Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_ENETC_GLOBAL.h
/* The count of ENETC_GLOBAL_HTALPBCOR */
#define ENETC_GLOBAL_HTALPBCOR_COUNT             (1U)

/*! @name HTATFCOR - HTA 0 transmit frame count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTATFCOR_HP_COUNT_MASK      (0xFFU)
#define ENETC_GLOBAL_HTATFCOR_HP_COUNT_SHIFT     (0U)
#define ENETC_GLOBAL_HTATFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTATFCOR_HP_COUNT_MASK)

#define ENETC_GLOBAL_HTATFCOR_HP_HWM_MASK        (0xFF00U)
#define ENETC_GLOBAL_HTATFCOR_HP_HWM_SHIFT       (8U)
#define ENETC_GLOBAL_HTATFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_HP_HWM_SHIFT)) & ENETC_GLOBAL_HTATFCOR_HP_HWM_MASK)

#define ENETC_GLOBAL_HTATFCOR_LP_COUNT_MASK      (0xFF0000U)
#define ENETC_GLOBAL_HTATFCOR_LP_COUNT_SHIFT     (16U)
#define ENETC_GLOBAL_HTATFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTATFCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTATFCOR_LP_HWM_MASK        (0xFF000000U)
#define ENETC_GLOBAL_HTATFCOR_LP_HWM_SHIFT       (24U)
#define ENETC_GLOBAL_HTATFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_LP_HWM_SHIFT)) & ENETC_GLOBAL_HTATFCOR_LP_HWM_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_HTATFCOR */
#define ENETC_GLOBAL_HTATFCOR_COUNT              (1U)

/*! @name RCSBRLAR - Root complex 0 system bus read latency average register */
/*! @{ */

#define ENETC_GLOBAL_RCSBRLAR_FRACT_MASK         (0xFFU)
#define ENETC_GLOBAL_RCSBRLAR_FRACT_SHIFT        (0U)
#define ENETC_GLOBAL_RCSBRLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLAR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBRLAR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBRLAR_INT_MASK           (0xFFF00U)
#define ENETC_GLOBAL_RCSBRLAR_INT_SHIFT          (8U)
#define ENETC_GLOBAL_RCSBRLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLAR_INT_SHIFT)) & ENETC_GLOBAL_RCSBRLAR_INT_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_RCSBRLAR */
#define ENETC_GLOBAL_RCSBRLAR_COUNT              (1U)

/*! @name RCSBRLHWMR - Root complex 0 system bus read latency high watermark register */
/*! @{ */

#define ENETC_GLOBAL_RCSBRLHWMR_FRACT_MASK       (0xFFU)
#define ENETC_GLOBAL_RCSBRLHWMR_FRACT_SHIFT      (0U)
#define ENETC_GLOBAL_RCSBRLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBRLHWMR_INT_MASK         (0xFFF00U)
#define ENETC_GLOBAL_RCSBRLHWMR_INT_SHIFT        (8U)
#define ENETC_GLOBAL_RCSBRLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & ENETC_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_RCSBRLHWMR */
#define ENETC_GLOBAL_RCSBRLHWMR_COUNT            (1U)

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define ENETC_GLOBAL_RCSBWLAR_FRACT_MASK         (0xFFU)
#define ENETC_GLOBAL_RCSBWLAR_FRACT_SHIFT        (0U)
#define ENETC_GLOBAL_RCSBWLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBWLAR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBWLAR_INT_MASK           (0xFFF00U)
#define ENETC_GLOBAL_RCSBWLAR_INT_SHIFT          (8U)
#define ENETC_GLOBAL_RCSBWLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLAR_INT_SHIFT)) & ENETC_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_RCSBWLAR */
#define ENETC_GLOBAL_RCSBWLAR_COUNT              (1U)

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define ENETC_GLOBAL_RCSBWLHWMR_FRACT_MASK       (0xFFU)
#define ENETC_GLOBAL_RCSBWLHWMR_FRACT_SHIFT      (0U)
#define ENETC_GLOBAL_RCSBWLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBWLHWMR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBWLHWMR_INT_MASK         (0xFFF00U)
#define ENETC_GLOBAL_RCSBWLHWMR_INT_SHIFT        (8U)
#define ENETC_GLOBAL_RCSBWLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & ENETC_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_RCSBWLHWMR */
#define ENETC_GLOBAL_RCSBWLHWMR_COUNT            (1U)

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define ENETC_GLOBAL_IPBRR0_IP_MN_MASK           (0xFFU)
#define ENETC_GLOBAL_IPBRR0_IP_MN_SHIFT          (0U)
#define ENETC_GLOBAL_IPBRR0_IP_MN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR0_IP_MN_SHIFT)) & ENETC_GLOBAL_IPBRR0_IP_MN_MASK)

#define ENETC_GLOBAL_IPBRR0_IP_MJ_MASK           (0xFF00U)
#define ENETC_GLOBAL_IPBRR0_IP_MJ_SHIFT          (8U)
#define ENETC_GLOBAL_IPBRR0_IP_MJ(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & ENETC_GLOBAL_IPBRR0_IP_MJ_MASK)

#define ENETC_GLOBAL_IPBRR0_IP_ID_MASK           (0xFFFF0000U)
#define ENETC_GLOBAL_IPBRR0_IP_ID_SHIFT          (16U)
#define ENETC_GLOBAL_IPBRR0_IP_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR0_IP_ID_SHIFT)) & ENETC_GLOBAL_IPBRR0_IP_ID_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

#define ENETC_GLOBAL_IPBRR1_IP_CFG_MASK          (0xFFU)
#define ENETC_GLOBAL_IPBRR1_IP_CFG_SHIFT         (0U)
#define ENETC_GLOBAL_IPBRR1_IP_CFG(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_CFG_MASK)

#define ENETC_GLOBAL_IPBRR1_IP_MNT_MASK          (0xFF00U)
#define ENETC_GLOBAL_IPBRR1_IP_MNT_SHIFT         (8U)
#define ENETC_GLOBAL_IPBRR1_IP_MNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_MNT_MASK)

#define ENETC_GLOBAL_IPBRR1_IP_INT_MASK          (0xFF0000U)
#define ENETC_GLOBAL_IPBRR1_IP_INT_SHIFT         (16U)
#define ENETC_GLOBAL_IPBRR1_IP_INT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_INT_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

