Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_ENETC_GLOBAL.h
/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define ENETC_GLOBAL_FBLPR_PARAM_VAL_MASK        (0xFFFFFFFFU)
#define ENETC_GLOBAL_FBLPR_PARAM_VAL_SHIFT       (0U)
#define ENETC_GLOBAL_FBLPR_PARAM_VAL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & ENETC_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_FBLPR */
#define ENETC_GLOBAL_FBLPR_COUNT                 (2U)

/*! @name EMDIOUFSBECR - EMDIO uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_GLOBAL_EMDIOUFSBECR_RD_MASK        (0x80000000U)
#define ENETC_GLOBAL_EMDIOUFSBECR_RD_SHIFT       (31U)
/*! RD - Report disable */
#define ENETC_GLOBAL_EMDIOUFSBECR_RD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_EMDIOUFSBECR_RD_SHIFT)) & ENETC_GLOBAL_EMDIOUFSBECR_RD_MASK)
/*! @} */

/*! @name EMDIOUFSBESR - EMDIO uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_GLOBAL_EMDIOUFSBESR_SB_ID_MASK     (0xFU)
#define ENETC_GLOBAL_EMDIOUFSBESR_SB_ID_SHIFT    (0U)
/*! SB_ID - System Bus ID */
#define ENETC_GLOBAL_EMDIOUFSBESR_SB_ID(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_EMDIOUFSBESR_SB_ID_SHIFT)) & ENETC_GLOBAL_EMDIOUFSBESR_SB_ID_MASK)

#define ENETC_GLOBAL_EMDIOUFSBESR_M_MASK         (0x40000000U)
#define ENETC_GLOBAL_EMDIOUFSBESR_M_SHIFT        (30U)
/*! M - Multiple */
#define ENETC_GLOBAL_EMDIOUFSBESR_M(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_EMDIOUFSBESR_M_SHIFT)) & ENETC_GLOBAL_EMDIOUFSBESR_M_MASK)

#define ENETC_GLOBAL_EMDIOUFSBESR_SBE_MASK       (0x80000000U)
#define ENETC_GLOBAL_EMDIOUFSBESR_SBE_SHIFT      (31U)
/*! SBE - System bus error */
#define ENETC_GLOBAL_EMDIOUFSBESR_SBE(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_EMDIOUFSBESR_SBE_SHIFT)) & ENETC_GLOBAL_EMDIOUFSBESR_SBE_MASK)
/*! @} */

/*! @name TUFSBECR - Timer uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_GLOBAL_TUFSBECR_RD_MASK            (0x80000000U)
#define ENETC_GLOBAL_TUFSBECR_RD_SHIFT           (31U)
/*! RD - Report disable */
#define ENETC_GLOBAL_TUFSBECR_RD(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_TUFSBECR_RD_SHIFT)) & ENETC_GLOBAL_TUFSBECR_RD_MASK)
/*! @} */

/*! @name TUFSBESR - Timer uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_GLOBAL_TUFSBESR_SB_ID_MASK         (0xFU)
#define ENETC_GLOBAL_TUFSBESR_SB_ID_SHIFT        (0U)
/*! SB_ID - System Bus ID */
#define ENETC_GLOBAL_TUFSBESR_SB_ID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_TUFSBESR_SB_ID_SHIFT)) & ENETC_GLOBAL_TUFSBESR_SB_ID_MASK)

#define ENETC_GLOBAL_TUFSBESR_M_MASK             (0x40000000U)
#define ENETC_GLOBAL_TUFSBESR_M_SHIFT            (30U)
/*! M - Multiple */
#define ENETC_GLOBAL_TUFSBESR_M(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_TUFSBESR_M_SHIFT)) & ENETC_GLOBAL_TUFSBESR_M_MASK)

#define ENETC_GLOBAL_TUFSBESR_SBE_MASK           (0x80000000U)
#define ENETC_GLOBAL_TUFSBESR_SBE_SHIFT          (31U)
/*! SBE - System bus error */
#define ENETC_GLOBAL_TUFSBESR_SBE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_TUFSBESR_SBE_SHIFT)) & ENETC_GLOBAL_TUFSBESR_SBE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ENETC_GLOBAL_Register_Masks */


/*!
 * @}
 */ /* end of group ENETC_GLOBAL_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ENETC_GLOBAL_H_ */

